from datetime import datetime


def solution(lines: list[str]):
    answer = 0
    # 우선순위 큐
    # 시간 더하기 가장 빠른 시간을 앞으로
    test_time = lines[0].split(' ')

    time_obj = datetime.strptime(
        ''.join(test_time[0], test_time[1]), "%y%m%d %H:%M:%S.%f")
    print(time_obj)
    return answer


print(solution([
    "2016-09-15 01:00:04.001 2.0s",
    "2016-09-15 01:00:07.000 2s"
]) == 1)
print(solution([
    "2016-09-15 01:00:04.002 2.0s",
    "2016-09-15 01:00:07.000 2s"
]) == 2)
print(solution([
    "2016-09-15 20:59:57.421 0.351s",
    "2016-09-15 20:59:58.233 1.181s",
    "2016-09-15 20:59:58.299 0.8s",
    "2016-09-15 20:59:58.688 1.041s",
    "2016-09-15 20:59:59.591 1.412s",
    "2016-09-15 21:00:00.464 1.466s",
    "2016-09-15 21:00:00.741 1.581s",
    "2016-09-15 21:00:00.748 2.31s",
    "2016-09-15 21:00:00.966 0.381s",
    "2016-09-15 21:00:02.066 2.62s"
]) == 7)
